html/meeting-notes/2013-04-02.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Meeting Notes 2012-01-19</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Meeting Notes 2012-01-19"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-04-02 19:35:09 EDT"/>
<meta name="author" content="Mishal Awadah"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="sitemap.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Meeting Notes 2012-01-19</h1>


<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-30426956-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>




<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Dinner before business</a></li>
<li><a href="#sec-2">Bars, Garbage Chutes, and Tap House</a></li>
<li><a href="#sec-3">The Emacs Club Dotfiles Party</a></li>
<li><a href="#sec-4">Dotfiles Party Planning</a></li>
<li><a href="#sec-5">The Content</a></li>
<li><a href="#sec-6">Matt's Meeting Notes</a></li>
<li><a href="#sec-7">Soy Foam</a></li>
<li><a href="#sec-8">The Basics</a>
<ul>
<li><a href="#sec-8-1">Dotfiles</a></li>
<li><a href="#sec-8-2">Environment vars</a></li>
<li><a href="#sec-8-3">Aliases</a></li>
<li><a href="#sec-8-4">Functions</a></li>
</ul>
</li>
<li><a href="#sec-9">Practical uses</a>
<ul>
<li><a href="#sec-9-1">Potluck</a></li>
</ul>
</li>
<li><a href="#sec-10">There must be a mode!</a></li>
<li><a href="#sec-11">Zach writes a custom delete-line-up-to-next-line function.</a></li>
<li><a href="#sec-12">The new crack</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Dinner before business</h2>
<div class="outline-text-2" id="text-1">

<p>  As the Dining Philosophers have decided to terminate our dinner
  funding, we are forced to bring our own food. 
</p></div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Bars, Garbage Chutes, and Tap House</h2>
<div class="outline-text-2" id="text-2">

</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">The Emacs Club Dotfiles Party</h2>
<div class="outline-text-2" id="text-3">

<ul>
<li>Next Tuesday. 
</li>
<li>We need a venue. All the usual rooms are unavailable.
</li>
<li>The discussion immediately switches to bars again. And which bar could
    host Emacs Club. They would need to have a projector. 
</li>
<li>We decide to postpone to the week after. 
</li>
</ul>

</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Dotfiles Party Planning</h2>
<div class="outline-text-2" id="text-4">

<ul>
<li>Levine 307, April 16th
</li>
</ul>

</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">The Content</h2>
<div class="outline-text-2" id="text-5">

<ul>
<li>What are dotfiles? 
</li>
<li>Symlinking dotfiles to a git repo. 
</li>
<li>ssh executing a check on your dotfiles before logging you to your
    machine.
</li>
<li>Zach is opposed to adding more indirection to managing
    dotfiles. 
</li>
<li><b>Zach</b> : These kids don't understand what these things are that
    they're using.
</li>
<li>We want the vim club kids to join this. They tried to start
    something but couldn't get out of movement mode. 
</li>
</ul>

</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">Matt's Meeting Notes</h2>
<div class="outline-text-2" id="text-6">

<ul>
<li>Where's Matt Croop? We miss his meeting notes.
</li>
</ul>

</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7">Soy Foam</h2>
<div class="outline-text-2" id="text-7">

<ul>
<li><b>Zach</b> : The foam after shaking a packet of soy sauce is gross.
</li>
<li>Zach is able to halt all conversation by displaying more soy foam.
</li>
</ul>

</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8">The Basics</h2>
<div class="outline-text-2" id="text-8">


</div>

<div id="outline-container-8-1" class="outline-3">
<h3 id="sec-8-1">Dotfiles</h3>
<div class="outline-text-3" id="text-8-1">

<ul>
<li>What is a dotfile?
</li>
<li>What is Bash?
</li>
<li>The order files are loaded in (depends on OS).
</li>
</ul>

</div>

</div>

<div id="outline-container-8-2" class="outline-3">
<h3 id="sec-8-2">Environment vars</h3>
<div class="outline-text-3" id="text-8-2">

<ul>
<li>Environment variables, the important ones. 
<ul>
<li>PATH
</li>
<li>HOME
</li>
<li>CLASSPATH
</li>
<li>USER
</li>
<li>EDITOR
      Just call env and talk about some. 
</li>
</ul>

</li>
<li>Can set your own environment variables and use them later. 
</li>
<li>Demonstrate what happens when you screw up PATH. 
</li>
</ul>

</div>

</div>

<div id="outline-container-8-3" class="outline-3">
<h3 id="sec-8-3">Aliases</h3>
<div class="outline-text-3" id="text-8-3">

<ul>
<li>How to
</li>
<li>Necessary mv and rm aliases to -i.
</li>
</ul>

</div>

</div>

<div id="outline-container-8-4" class="outline-3">
<h3 id="sec-8-4">Functions</h3>
<div class="outline-text-3" id="text-8-4">

<ul>
<li>cd-ls -&gt; cl
</li>
<li>Rafe's untar-ing function.
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9">Practical uses</h2>
<div class="outline-text-2" id="text-9">


</div>

<div id="outline-container-9-1" class="outline-3">
<h3 id="sec-9-1">Potluck</h3>
<div class="outline-text-3" id="text-9-1">

<ul>
<li>Get audience to provide their dotfiles and share with others. 
</li>
<li>Make sure Ceasar attends.
</li>
<li>Start out with Rafe.
</li>
<li>Go through our dotfiles. 
</li>
<li>zsh.
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10">There must be a mode!</h2>
<div class="outline-text-2" id="text-10">

<ul>
<li>We talk of newsticker, for an alternative to Google Reader. 
</li>
<li>fci-mode, a subtle 80 char limit line.
</li>
</ul>

</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11">Zach writes a custom delete-line-up-to-next-line function.</h2>
<div class="outline-text-2" id="text-11">

</div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12">The new crack</h2>
<div class="outline-text-2" id="text-12">

<ul>
<li><a href="http://emacsredux.com/">http://emacsredux.com/</a>
</li>
</ul>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-04-02 19:35:09 EDT</p>
<p class="author">Author: Mishal Awadah</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
